import { IconButton } from "@mui/material";
import * as React from "react";
import { useNavigate } from "react-router-dom";
import styled from "styled-components";
import ArrowBackIosNewIcon from "@mui/icons-material/ArrowBackIosNew";

export function Navsari() {
    const navigate = useNavigate();
    const headingStyle = {
        fontWeight: "bold",
        fontSize: "1.25rem"
    }
    return (
        <>
            <TopBar>
                <IconButton onClick={() => navigate(-1)}>
                    {" "}
                    {/* Navigate back */}
                    <img
                        src="https://cdn.builder.io/api/v1/image/assets/TEMP/1fd569ca716b29d7f1a98071e37fd2287542114cc8243ecad11b40ab9ef936c8?apiKey=65b9bef5a9974c109a4afdb193963080&"
                        alt="Back button"
                    />
                </IconButton>
            </TopBar>
            <MainContainer>
                <TemplePageContainer>
                    <Header>
                        <Title>BAPS Shree Swaminarayan Mandir, Navsari</Title>
                    </Header>
                    <TempleImageWrapper>
                        <TempleImage
                            src="https://cdn.builder.io/api/v1/image/assets/TEMP/351507c98c19beda031a9ab798515020e4dfe2b615ea1d64e6a0c47ee617db8e?apiKey=3250d16d0ad044539de68d3e33600ce8&"
                            alt="BAPS Shree Swaminarayan Mandir, Navsari"
                        />
                    </TempleImageWrapper>
                </TemplePageContainer>

                <Content>
                    <Paragraph>
                        ૧૫મી સદીના સમયગાળામાં પારસીઓનું અહીં આગમન થયું. અહીંની આબોહવા ઈરાનના સારી નામના પ્રદેશની આબોહવાને મળતી હોવાથી આ નગરને નૌ(નવું)-સારી નામ આપ્યું. અંતે અપભ્રંશ થઈને નામ પડ્યું નવસારી. પારસીઓ દ્વારા આ નગરને અનેક શાળાઓ, કોલેજો અને હોસ્પિટલની ભેટ મળી છે.
                        આ શહેર નવસારી તરીકે વિખ્યાતી પામતા પહેલા નાગવર્ધન, નાગશાહી, નવસરેહ, નાગમંડળ, નાગસારિકા અને પારસીપૂરી જેવા નામોથી પણ ઓળખાતું.
                        <br />
                    </Paragraph>

                    <Paragraph>
                        ઈતિહાસમાં નોંધાયું છે કે ૨૦૦૦ વર્ષ પૂર્વે નવસારી એક મહત્વના બંદર તરીકે વિશ્વના દેશો સાથે વ્યાપારિક સંબંધો ધરાવતું હતું.
                        <br />
                    </Paragraph>

                    <Paragraph>
                        સયાજીરાવ ગાયકવાડની દીર્ઘદ્રષ્ટિને લીધે આધુનિક નવસારીને આયોજિત નગર રચનાની ભેટ મળી.
                        સ્વરાજ્ય શબ્દના પ્રથમ છડીદાર દાદાભાઈ નવરોજી, ભારતમાં ઔદ્યોગિક ક્રાંતિના પ્રણેતા જમશેદજી ટાટા, ભારતના સૌપ્રથમ બેરોનેટ જમશેદજીભાઈ જીજીભાઈ, મહારાષ્ટ્રના સેક્સપિયર નાટ્યવિદ બાલ ગણેશ ગડકરી વગેરે મહાનુભાવોની ભેટ ભારતને આ ભૂમિએ આપી છે.
                        <br />
                    </Paragraph>

                    <Paragraph>
                        મહાકવિ પ્રેમાનંદે રણયજ્ઞ આખ્યાન અહીં લખ્યું, પ્રસિદ્ધ નવલકથાકાર રણમલ દેસાઈને નવલકથા ગ્રામલક્ષ્મી લખવાની પ્રેરણા અહી મળી, ‘સહુ ચલો જીતવા જંગ’ કાવ્ય સૌપ્રથમ નર્મદે અહી લલકારેલું. પારસી કવિ માણેકજી જહાંગીરજી દેસાઈ અહીંનું જ રત્ન હતા.
                        ગુજરાત સરકારે ૧૯૯૭માં નવસારીને સ્વતંત્ર જીલ્લા તરીકે ઘોષિત કર્યો હતો.
                        <br />
                    </Paragraph>

                    <Paragraph style={headingStyle}>
                        ભગવાન સ્વામિનારાયણ અને નવસારી
                        <br />
                    </Paragraph>

                    <Paragraph>
                        સંવંત ૧૮૪૯માં નીલકંઠવર્ણી ગુજરાતમાં સૌપ્રથમ દંડકારણ્ય વનમાં પધાર્યા (એટલે આજનું ડાંગ) અને ત્યાંથી સુરત પધાર્યા. ત્યારે નવસારીને સૌપ્રથમ પાવન સ્પર્શનો લાભ મળ્યો.
                        સને ૧૮૧૬માં શ્રીજી મહારાજ કુશળકુંવરબાના આમંત્રણને સ્વીકારી ધરમપુર જવા નીકળ્યા ત્યારે નવસારી પ્રાંતના આ સુંદર ગામે રાત્રિ રોકાણ કરેલ. ત્યાંથી કાછીયાવાડી અને કાલિયાવાડી થઈને નવસારીમાં પધાર્યા. ત્યાથી કોલવા-ચીખલી થઈ ધરમપુર પધાર્યા.
                        <br />
                    </Paragraph>

                    <Paragraph style={headingStyle}>
                        ગુણાતીતાનંદ સ્વામી અને નવસારી
                        <br />
                    </Paragraph>

                    <Paragraph>
                        શ્રીજી મહારાજના સમયમાં સંઘના વિચરણ દરમ્યાન માર્ગમાં ઉધના ગામમાં દેવાનંદ સ્વામી બીમાર પડતા ગુણાતીતાનંદ સ્વામી તેમની સેવામાં રોકાયા. થોડા દિવસમાં દેવાનંદ સ્વામી સાજા થઈ જતા ગુણાતીતાનંદ સ્વામી ધરમપુર પધાર્યા. આમ, આવતા જતા બંને વખત નવસારીની ભૂમિને મહારાજ અને સ્વામીનો પાવન સ્પર્શ થયો હતો.
                        <br />
                    </Paragraph>

                    <Paragraph style={headingStyle}>
                        ભગતજી મહારાજ અને નવસારી
                        <br />
                    </Paragraph>

                    <Paragraph>
                        નવસારી પ્રાંતના વાંસદા રાજ્યના દિવાન ઝવેરભાઈ અમીન હતા ત્યારે શાસ્ત્રીજી મહારાજ સંતો સાથે વિચરણ કરતા અહીં પધાર્યા. શાસ્ત્રીજી મહારાજની વાતોથી દીવાનજીને ભગતજી મહારાજના દર્શનની તાલાવેલી જાગી અને તેમણે વડતાલ આચાર્ય તથા કોઠારીને પત્ર લખી વાંસદામાં ભગતજી મહારાજને તેડાવવા વિનંતી કરી. આથી હરિભક્તો સાથે ભગતજી મહારાજ અહીં પધારેલા. તેમનું દીવાને ભવ્ય સ્વાગત કર્યું. ત્યારે ટ્રેનમાંથી ભગતજી મહારાજે નવસારી પર દ્રષ્ટિ કરી હતી.
                        <br />
                    </Paragraph>

                    <Paragraph style={headingStyle}>
                        શાસ્ત્રીજી મહારાજ અને નવસારી
                        <br />
                    </Paragraph>

                    <Paragraph>
                        શાસ્ત્રીજી મહારાજ મંદિરો અને હવેલીના નિર્માણ માટે જરૂરી લાકડા માટે વારંવાર બીલીમોરા પધારતા. ત્યારે નવસારીને તેમના પાદ સ્પર્શનો લાભ મળતો.
                        <br />
                    </Paragraph>

                    <Paragraph style={headingStyle}>
                        યોગીજી મહારાજ અને નવસારી
                        <br />
                    </Paragraph>

                    <Paragraph>
                        યોગીજી મહારાજ સૌપ્રથમ ૧૯૬૬માં અહીં પધાર્યા. તા. ૧૭/૦૯/૧૯૬૬ના દિવસે લક્ષ્મણ હોલમાં જાહેર સત્સંગ સભાનું આયોજન થયું. ભક્તોના મનમાં શંકા કે હોલ ભરાશે કે નહીં ભરાય? પણ સવારે યોગીજી મહારાજની શોભાયાત્રાના પ્રભાવથી આકર્ષિત થયેલી ધર્મપ્રેમી જનતા ખૂબ મોટી સંખ્યામાં આવતા બેસવાની જગ્યા ખુટી પડી! એ જોઈ તે સમયના નગરપતિ કીકુભાઈ દેસાઈએ કહેલું કે, “નવસારીના ઇતિહાસમાં આવી સભા કોઈ દિવસ થઈ નથી.”
                        સને ૧૯૬૮માં પણ યોગીજી મહારાજ બીલીમોરા, ઇટાડવા થઈ નવસારી પધાર્યા. તેઓએ કહ્યું હતું, ‘ભગવાન તો સોનાના મંદિર ઉગાડે પણ ભક્તોના દેશકાળ સુધારવા માટે સેવા ગ્રહણ કરે છે’ એ જ વચનો પ્રમાણે ભવ્ય મંદિરનુ બીજ તેમણે વાવી દીધું.
                        <br />
                    </Paragraph>

                    <Paragraph style={headingStyle}>
                        પ્રમુખસ્વામી મહારાજ અને નવસારી
                        <br />
                    </Paragraph>

                    <Paragraph>
                        પ્રમુખસ્વામી મહારાજ ૬૦થી વધુ વાર અહીં પધાર્યા હતા. સને ૧૯૮૫માં નવસારીમાં નવી ચોવીસી ખાતે હરીમંદિરનું નિર્માણ કર્યું. ત્યારથી અહીં સત્સંગની અભિવૃદ્ધિ થઈ.
                        સને ૧૯૮૮માં વિદેશ યાત્રા પછી નવસારીની સમગ્ર જનતા વતી ટાટા હોલમાં અહીંની ૫૧ જેટલી સંસ્થાઓએ સ્વામીશ્રીને સન્માન્યા હતા. અહીં દલિત સમાજ દ્વારા નિર્મિત પરીક્ષિતલાલ મજમુદાર છાત્રાલયનું ખાતમુહૂર્ત સ્વામીશ્રીએ કરેલુ. કૃષિ યુનિવર્સિટીના કેમ્પસમાં બંધાયેલી નૂતન પ્રાથમિક શાળાનું ઉદ્ઘાટન પણ બાપાએ કર્યું હતું. તેજલ અને શુશ્રૂષા હોસ્પિટલોનું ભૂમિ પૂજન પણ સ્વામીશ્રીએ કરેલું. પ્રમુખસ્વામી મહારાજ ધામગમન નિમિત્તે તેઓની સ્મૃતિમાં આશાપુરીમાં ‘પ્રમુખસ્વામી મહારાજ સત્સંગ હોલ’ નિર્માણ પામ્યો.
                        સને ૧૯૯૭માં બાપાનો ૭૭મો જન્મ જયંતી મહોત્સવ અહીં ઉજવાયો હતો. તેની સાથે હરિમંદિરમાં અક્ષરપુરુષોત્તમ મહારાજની મનોહર મૂર્તિઓનો પુનઃ પ્રાણ પ્રતિષ્ઠા ઉત્સવ પણ સંપન્ન થયો હતો.
                        સને ૨૦૦૪માં બાપાએ નવસારીને નુતન સભાગૃહની ભેટ આપી હતી.
                        દિલ્હી અક્ષરધામના ઉદ્ઘાટન બાદ સને ૨૦૦૬માં બાપા નવસારી પધાર્યા ત્યારે નગરપાલિકા અને સ્થાનિક વિવિધ સંસ્થાઓએ સન્માન પત્ર અર્પણ કરી સ્વામીશ્રીનું બહુમાન કર્યું હતું.
                        સને ૨૦૦૮માં પધાર્યા ત્યારે બાપાએ નૂતન શિખરબદ્ધ મંદિરનો સંકલ્પ કર્યો હતો.
                        સને ૨૦૧૧માં પધારી નાદુરસ્ત સ્વાસ્થ્ય વચ્ચે નિર્માણાધીન મંદિર પરિસરમાં પધારીને ભૂમિ પૂજન કર્યું હતું.
                        સને ૨૦૧૨માં અમદાવાદ ખાતે નૂતન મંદિરોની શિલાઓનું પૂજન કર્યું. ત્યારે સંતોએ પ્રાર્થના કરી કે ‘દિવ્ય દેહે આપ શિલાન્યાસ વિધિમાં પધારજો.’ ત્યારે સ્વામીશ્રીએ કહ્યું કે “પ્રત્યક્ષ આવવાની વાત કરોને!”
                        <br />
                    </Paragraph>

                    <Paragraph style={headingStyle}>
                        મહંતસ્વામી મહારાજ અને નવસારી
                        <br />
                    </Paragraph>

                    <Paragraph>
                        પૂજ્ય મહંતસ્વામી મહારાજના હસ્તે નૂતન મંદિર શિલાન્યાસ વિધિ થયો. ત્યારે સૌને અનુભવ થયો કે બ્રહ્મસ્વરૂપ પ્રમુખસ્વામી મહારાજ પૂજ્ય મહંતસ્વામી મહારાજરૂપે જ પૂજન કરવા પધાર્યા છે.
                        તા. ૩૦/૦૧/૨૦૨૦, વસંતપંચમીના રોજ પ્રગટ બ્રહ્મસ્વરૂપ મહંતસ્વામી મહારાજના વરદ હસ્તે નવસારીમાં નૂતન શિખરબદ્ધ મંદિરની પ્રતિષ્ઠા સંપન્ન થઇ હતી.
                        સકલ શાસ્ત્રોના સારભૂત “સત્સંગ દીક્ષા” ગ્રંથના લેખન કાર્યનો શુભારંભ ગુરુહરી મહંતસ્વામી મહારાજે નવસારીથી કર્યો હતો. જેની સ્મૃતિ સ્વરૂપે મંદિરની પ્રદક્ષિણામાં સત્સંગ દીક્ષાના તમામ શ્લોકોનું ત્રણ ભાષામાં સુંદર આલેખન કરવામાં આવ્યું છે.
                        <br />
                    </Paragraph>

                    <Paragraph style={headingStyle}>
                        નવસારી મંદિર મહિમા
                        <br />
                    </Paragraph>

                    <Paragraph>
                        નવસારી મંદિર ગુજરાતનું બીજા નંબરનું સૌથી મોટું આરસનું મંદિર છે. જેમાં કુલ ૭૦,૦૦૦ ઘનફૂટ આરસનો ઉપયોગ થયો છે.
                        મંદિર ફરતે ૯૦૦ ફૂટ લાંબી ગજરાજોથી શોભિત ગજેન્દ્રપીઠ આવેલી છે.
                        નવસારી મંદિરની છત્રછાયા નીચે ચાલતા સેવાકાર્યો

                        ૧૫૦થી વધુ સત્સંગ કેન્દ્રો દ્વારા સત્સંગ અને સંસ્કૃતિના ઉચ્ચ મૂલ્યોનું પ્રવર્તનકાર્ય થાય છે.
                        ૧૦૦થી વધુ બાલ-બાલિકા સભાઓ દ્વારા ઉમદા ચારિત્ર્ય અને સંસ્કારોનું સિંચનકાર્ય થાય છે.
                        સત્સંગ પ્રવૃત્તિમાં ૪૨૫થી વધુ મંડળો (સંયુક્ત, યુવા, મહિલા, યુવતી, બાળ મંડળો) અને ૩૫થી વધુ ગામોમાં હરિમંદિરોનું નિર્માણકાર્ય થયું છે.
                        ડાંગ-વાંસદાના આદિવાસી વિસ્તારમાં ૧૨થી વધુ કુટિર મંદિરો અને ૫૦થી વધુ સત્સંગ સભાઓ દ્વારા ધાર્મિક જાગૃતિકાર્ય ચાલુ છે.
                        રંભાસ(ડાંગ)માં આદિવાસી છાત્રાલય અને શાળા દ્વારા ૨૦૦થી વધુ વિધાર્થીઓને વિનામૂલ્યે સંસ્કારયુકત શિક્ષણકાર્ય ચાલે છે.
                        ૨ મોબાઈલ દવાખાનાં દ્વારા વિનામૂલ્યે રોગ ચિકિત્સા અને ઉપચારકાર્ય ચાલે છે.
                        વ્યસનમુકિત અને સદાચારવૃદ્ધિ દ્વારા માનવ ઉત્કર્ષકાર્ય અને પૂર-હોનારત જેવી કુદરતી આપત્તિઓમાં રાહતકાર્યો પણ કાર્યરત છે.
                        <br />
                    </Paragraph>

                </Content>
            </MainContainer>
        </>
    );
}

const MainContainer = styled.div`
  position: relative;
  margin-top: 21px;
  height: auto;
  padding: 0 20px;
`;

const Header = styled.header`
  background-color: #fff;
`;

const Title = styled.h2`
  background-color: #fff;
`;

const Content = styled.section`
  background-color: #fff;
`;

const Paragraph = styled.p`
  background-color: #fff;
`;

const TemplePageContainer = styled.main`
  display: flex;
  flex-direction: column;
  max-width: 480px;
  width: 100%;
  margin: 0 auto;
`;

const TempleTitle = styled.h1`
  color: var(--BG-Pink, #270025);
  font: 700 19px Overlock, sans-serif;
`;

const TempleImageWrapper = styled.figure`
  display: flex;
  flex-direction: column;
  justify-content: center;
  margin-top: 17px;
  border-radius: 8px;
`;

const TempleImage = styled.img`
  width: 100%;
  aspect-ratio: 1.47;
  object-fit: cover;
  object-position: center;
`;
const TopBar = styled.div`
  width: 100%;
  display: flex;
  justify-content: space-between;
  align-items: center;
  margin-top: 1.5rem;
  margin-left: 1.5rem;
`;

export default Navsari;
